ANG13T/ESP8266-WiCon-Kit/esppl_functions.h
#include <ESP8266WiFi.h>
#include "./esppl_struct.h"

extern "C" {
      #include "user_interface.h"
      typedef void (*freedom_outside_cb_t)(uint8 status);
        int  wifi_register_send_pkt_freedom_cb(freedom_outside_cb_t cb);
          void wifi_unregister_send_pkt_freedom_cb(void);
            int  wifi_send_pkt_freedom(uint8 *buf, int len, bool sys_seq);
            
}

uint8_t esppl_channel = ESPPL_CHANNEL_DEFAULT;
uint8_t esppl_default_mac[ESPPL_MAC_LEN] = {0x00,0x00,0x00,0x00,0x00,0x00};
ESPPL_CB_T user_cb;
int frame_waitlist = 0;
bool esppl_sniffing_enabled = false;

void esppl_buf_to_info(uint8_t *frame, signed rssi, uint16_t len);

/*
 *  * Promiscuous RX callback function
 *   */
void esppl_rx_cb(uint8_t *buf, uint16_t len) {
    if (len == sizeof(struct sniffer_buf2)) {
            struct sniffer_buf2 *sniffer = (struct sniffer_buf2*) buf;
                esppl_buf_to_info(sniffer->buf, sniffer->rx_ctrl.rssi, len);
                  
    } else if (len == sizeof(struct RxControl)) {
            struct RxControl *sniffer = (struct RxControl*) buf;
              
    } else {
            struct sniffer_buf *sniffer = (struct sniffer_buf*) buf;
                esppl_buf_to_info(sniffer->buf, sniffer->rx_ctrl.rssi, len);
                  
    }
    
}

/* 
 *  * buf to esppl_frame_info structure converter 
 *   */
void esppl_buf_to_info(uint8_t *frame, signed rssi, uint16_t len) {
      struct esppl_frame_info info;
        uint8_t dstofrom;
          uint8_t pos;
            uint8_t parsecount;

            if (esppl_sniffing_enabled) {
                    frame_waitlist++;
                        // - "Resets" some fields
                        //     memcpy(info.receiveraddr, esppl_default_mac, ESPPL_MAC_LEN);
                        //         memcpy(info.destinationaddr, esppl_default_mac, ESPPL_MAC_LEN);
                        //             memcpy(info.transmitteraddr, esppl_default_mac, ESPPL_MAC_LEN);
                        //                 memcpy(info.sourceaddr, esppl_default_mac, ESPPL_MAC_LEN);
                        //                     memcpy(info.bssid, esppl_default_mac, ESPPL_MAC_LEN);
                        //                         info.ssid_length = 0;
                        //                             info.isvalid = true;
                        //                                 info.channel = 0;
                        //                                     info.seq_num = 0;
                        //                                         // - Populates the fields
                        //                                             memcpy(info.raw, frame, len - 1);
                        //                                                 info.raw_length = len;
                        //                                                     
                        //                                                         info.frametype = (frame[0] & B00001100) >> 2;
                        //                                                             info.framesubtype = (frame[0] & B11110000) >> 4;
                        //                                                                 info.rssi = rssi;
                        //                                                                   
                        //                                                                       dstofrom = (frame[1] & 3);
                        //                                                                         
                        //                                                                             switch (info.frametype) {
                        //                                                                                   case ESPPL_CONTROL: // - Control Frames
                        //                                                                                           switch (info.framesubtype) {
                        //                                                                                                     case ESPPL_CONTROL_RTS: // - RTS
                        //                                                                                                                 memcpy(info.receiveraddr, frame + 4, ESPPL_MAC_LEN);
                        //                                                                                                                             memcpy(info.destinationaddr, frame + 4, ESPPL_MAC_LEN); //?
                        //                                                                                                                                         memcpy(info.transmitteraddr, frame + 4 + ESPPL_MAC_LEN, ESPPL_MAC_LEN);
                        //                                                                                                                                                     memcpy(info.sourceaddr, frame + 4 + ESPPL_MAC_LEN, ESPPL_MAC_LEN); //?
                        //                                                                                                                                                                 break;
                        //                                                                                                                                                                           case ESPPL_CONTROL_CTS: // - CTS
                        //                                                                                                                                                                                       memcpy(info.receiveraddr, frame + 4, ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                   memcpy(info.destinationaddr, frame + 4, ESPPL_MAC_LEN); //?
                        //                                                                                                                                                                                                               break;
                        //                                                                                                                                                                                                                         case ESPPL_CONTROL_ACK: // - ACK
                        //                                                                                                                                                                                                                                     memcpy(info.receiveraddr, frame + 4, ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                 memcpy(info.destinationaddr, frame + 4, ESPPL_MAC_LEN); //?
                        //                                                                                                                                                                                                                                                             break;
                        //                                                                                                                                                                                                                                                                       case ESPPL_CONTROL_PS_POLL: // - PS-POLL
                        //                                                                                                                                                                                                                                                                                   memcpy(info.receiveraddr, frame + 4, ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                               memcpy(info.destinationaddr, frame + 4, ESPPL_MAC_LEN); //?
                        //                                                                                                                                                                                                                                                                                                           memcpy(info.bssid, frame + 4, ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                                                       memcpy(info.transmitteraddr, frame + 4 + ESPPL_MAC_LEN, ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                                                                   memcpy(info.sourceaddr, frame + 4 + ESPPL_MAC_LEN, ESPPL_MAC_LEN); //?
                        //                                                                                                                                                                                                                                                                                                                                               break;
                        //                                                                                                                                                                                                                                                                                                                                                         case ESPPL_CONTROL_CF_END: // - CF-END
                        //                                                                                                                                                                                                                                                                                                                                                                     memcpy(info.receiveraddr, frame + 4, ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                                                                                                                 memcpy(info.destinationaddr, frame + 4, ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                                                                                                                             memcpy(info.transmitteraddr, frame + 4 + ESPPL_MAC_LEN, ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                                                                                                                                         memcpy(info.sourceaddr, frame + 4 + ESPPL_MAC_LEN, ESPPL_MAC_LEN);          
                        //                                                                                                                                                                                                                                                                                                                                                                                                                     memcpy(info.bssid, frame + 4 + ESPPL_MAC_LEN,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                     ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                 break;
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                           case
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                           ESPPL_CONTROL_CF_END_CF_ACK:
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                           // - CF-END+CF-ACK
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                       memcpy(info.receiveraddr,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                       frame + 4, ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                   memcpy(info.destinationaddr,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                   frame + 4,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                   ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                               memcpy(info.transmitteraddr,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                               frame + 4 +
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                               ESPPL_MAC_LEN,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                               ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           memcpy(info.sourceaddr,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           frame
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           +
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           4
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           +
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           ESPPL_MAC_LEN,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           ESPPL_MAC_LEN);          
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       memcpy(info.bssid,
