ANG13T/ESP8266-WiCon-Kit/esppl_functions.h
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               memcpy(info.receiveraddr,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               frame
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               +
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               4,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           memcpy(info.destinationaddr,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           frame
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           +
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           4,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       memcpy(info.transmitteraddr,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       frame
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       +
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       4
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       +
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       ESPPL_MAC_LEN,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   memcpy(info.sourceaddr,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   frame
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   +
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   4
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   +
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   ESPPL_MAC_LEN,
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   ESPPL_MAC_LEN);
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               break;
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         case
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         ESPPL_CONTROL_CONTROL_WRAPPER:
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         //
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         -
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         Control
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         Wrapper
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     //TODO
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 break;
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         }
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 break;
                        //                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       case
